/* 3^3=3+3^3-3
   6^3=6+6^3-6
这样可以把3和6提出来,与1,2,4,5等组成1至6的序列,其和值即n(n+1)/2
剩余部分3^3-3即1^3*3^3-1*3=1^3*27-1*3
6^3-6即2^3*3^3-2*3=2^3*27-2*3
后段即为1+2+3+...int(n/3)后,再乘以3,即int(n/3)*(int(n/3)+1)/2 *3
前段为1^3+2^3+3^3+...+int(n/3)^3后,再乘27
这里我搜了才知道1^3+2^3+3^3+..n^3=(1+2+3+..+n)^2=(n(n+1)/2)^2
将int(n/3)代入再乘27即可
由于C语言的特性,n/3是只取整的
因此最后公式 是n(n+1)/2-n/3*(n/3+1)/2*3+n/3*n/3*(n/3+1)*(n/3+1)/4*27
不知道有没写错哪里...excel验证通过的..  */
#include<iostream>
using namespace std;
int main()
{
   	__int64 s;
	__int64 n;
	while(scanf("%I64d", &n) != EOF && n >= 0) {
    	s = (n + 1) * n / 2 - (n / 3) * (3 + (n / 3) * 3) / 2 
			+ ((n / 3) * ((n / 3) + 1) / 2 * ((n / 3) + 1) * (n / 3) / 2) * 27;
    	printf("%I64d\n", s);
    }
	return 0;
}